LANG["ru"] = {}
LANG["ru"]["$SYMBOL"] = "ru"
LANG["ru"]["$INTRODUCTION"]             = [[[CLOSED BETA VERSION]
Добро пожаловать в еще один высер трапа! На этот раз это рп бот для людей которым ну слишком скучно. Общайтесь со всякими персонажами без какого либо ограничения, мне лично похуй. Если хотите своего персонажа то пишите мне в лс, добавлю.

Гайд по оформлению сообщений:
Тут все просто. Обычный текст это речь, все что в звездочках это действия.]]

LANG["ru"]["$NEW_CHAR"]                 = "Создать новый чат"
LANG["ru"]["$NEW_CHAR_MSG"]             = "Вот список всех доступных персонажей, нажмите на любого чтобы узнать больше"
LANG["ru"]["$NEW_CHAR_BACK"]            = "Назад"
LANG["ru"]["$NEW_CHAR_SELECT"]          = "Выбрать"
LANG["ru"]["$NEW_CHAR_REWRITE"]         = "ВНИМАНИЕ: у вас уже существует чат с этим персонажем. Вы можете его выбрать используя соотвествующее меню. Продолжение перезапишет и удалит существующий чат. Продолжить?"
LANG["ru"]["$NEW_CHAR_CONFIRM"]         = "Подтвердить удаление"


LANG["ru"]["$LOAD_CHAR"]                = "Открыть активный чат"
LANG["ru"]["$LOAD_CHAR_MSG"]            = "Вот список всех активных чатов. Нажмите чтобы открыть чат с этим персонажем"
LANG["ru"]["$LOAD_CHAR_BACK"]           = "Назад"


LANG["ru"]["$CHAT_BACK"]                = "Назад"
LANG["ru"]["$CHAT_REGENERATE"]          = "Сгенерировать заново"
LANG["ru"]["$CHAT_NOT_ENOUGH_TOKENS"]   = "У вас не хватает токенов! Необходимо пополнить баланс."
LANG["ru"]["$CHAT_GENERATION_FAULT"]    = "Произошла ошибка при попытке сгенерировать сообщение. Попробуйте снова"
LANG["ru"]["$CHAT_GENERATION_IMPOSSIBLE"]= "Ввиду повышенной нагрузки, генерация не может быть завершена. Попробуйте снова"


LANG["ru"]["$TOKENS"]                   = "Баланс"
LANG["ru"]["$TOKENS_CURRENT_BALANCE"]   = "У вас имеется %s токенов"
LANG["ru"]["$TOKENS_BACK"]              = "Назад"


LANG["ru"]["$DONATE_TEXT"]              = "Автоматическое пополнение баланса еще не готово. Пока только вручную через него: https://t.me/IneedName"
LANG["ru"]["$DONATE"]                   = "Купить токены"


LANG["ru"]["$DISPLAY_NAME"]             = "Имя в чате"
LANG["ru"]["$DISPLAY_NAME_TEXT"]        = "Введите свое новое имя (имя в истории сообщений не изменится)"
LANG["ru"]["$DISPLAY_NAME_SUCCESS"]     = "Имя изменено!"


LANG["ru"]["$PROMOCODE"]                = "Ввести промокод"
LANG["ru"]["$PROMOCODE_TEXT"]            = "Введите промокод чтобы получить бесплатные токены."
LANG["ru"]["$PROMOCODE_REFERAL_FAILURE"] = "Вы уже вводили реферальный промокод"
LANG["ru"]["$PROMOCODE_REFERAL_SUCCESS"] = "Реферальный промокод успешно введен!"
LANG["ru"]["$PROMOCODE_SUCCESS"]         = "Промокод успешно введен!"
LANG["ru"]["$PROMOCODE_NOTFOUND"]        = "Данный промокод не был найден. Проверьте правильность написания"


LANG["ru"]["$LANG_CHANGE_TEXT"]          = "Выберите язык"


LANG["ru"]["$AWAIT_FOR_MESSAGE"]        = "Сообщение генерируется..."
LANG["ru"]["$UNFINISHED_GENERATION"]    = "Дождитесь генерации сообщения..."