LANG["ru"] = {}
LANG["ru"]["$SYMBOL"] = "🇷🇺"
LANG["ru"]["$INTRODUCTION"]             = [[Хей! Это бот, который позволяет вам свободно общаться с персонажами из аниме, игр... ну и так далее. 
Вы можете делать с этими персонажами все, что захотите. Я не поддерживаю никакую цензуру. Просто веселитесь!
Каждое сообщение стоит токены, вы получаете их с бесплатным ежедневным бонусом или покупаете их по подписке (самое выгодное) или отдельно.
Если вы столкнулись со странным поведением бота или у вас есть классная идея, не стесняйтесь писать в поддержку (https://t.me/CarpAISupportBot).

Руководство по написанию сообщений:
Все просто. Обычный текст - это речь, все, что заключено в звездочки, - это действия.]]
LANG["ru"]["$CRASH"]                    = [[Произошла непредвиденная ошибка. Пожалуйста попробуйте снова]]

LANG["ru"]["$NEW_CHAR"]                 = "Создать новый чат"
LANG["ru"]["$NEW_CHAR_MSG"]             = "Вот список всех доступных персонажей, нажмите на любого чтобы узнать больше"
LANG["ru"]["$NEW_CHAR_BACK"]            = "Назад"
LANG["ru"]["$NEW_CHAR_SELECT"]          = "Выбрать"
LANG["ru"]["$NEW_CHAR_REWRITE"]         = "ВНИМАНИЕ: у вас уже существует чат с этим персонажем. Вы можете его выбрать используя соотвествующее меню. Продолжение перезапишет и удалит существующий чат. Продолжить?"
LANG["ru"]["$NEW_CHAR_CONFIRM"]         = "Подтвердить удаление"
LANG["ru"]["$NEW_CHAR_WEEKLY"]          = "Персонаж Недели: %s"


LANG["ru"]["$LOAD_CHAR"]                = "Открыть активный чат"
LANG["ru"]["$LOAD_CHAR_MSG"]            = "Вот список всех активных чатов. Нажмите чтобы открыть чат с этим персонажем"
LANG["ru"]["$LOAD_CHAR_BACK"]           = "Назад"


LANG["ru"]["$CHAT_BACK"]                = "Назад"
LANG["ru"]["$CHAT_REGENERATE"]          = "Сгенерировать заново"
LANG["ru"]["$CHAT_NOT_ENOUGH_TOKENS"]   = "У вас не хватает токенов! Необходимо пополнить баланс."
LANG["ru"]["$CHAT_GENERATION_FAULT"]    = "Произошла ошибка при попытке сгенерировать сообщение. Попробуйте снова."
LANG["ru"]["$CHAT_GENERATION_IMPOSSIBLE"]= "Ввиду повышенной нагрузки, генерация не может быть завершена. Попробуйте снова."
LANG["ru"]["$CHAT_GENERATION_EMPTY"]    = "Нейросеть вернула пустое сообщение. Токены не были потрачены, попробуйте снова."


LANG["ru"]["$TOKENS"]                   = "Баланс"
LANG["ru"]["$TOKENS_CURRENT_BALANCE"]   = "У вас имеется %s токенов.\nВаш уровень подписки также дает вам экстра %s токенов на этот месяц"
LANG["ru"]["$TOKENS_BACK"]              = "Назад"


LANG["ru"]["$DONATE"]                    = "Купить токены"
LANG["ru"]["$DONATE_BACK"]               = "Назад"
LANG["ru"]["$DONATE_CRYPTO"]             = "Криптовалюта (скидка 20%!)"
LANG["ru"]["$DONATE_CRYPTO_GUIDE"]       = [[Для оплаты криптовалютой можно использовать любой Bitcoin/USDT кошелек. 
Если все это выглядит слишком сложно, не переживайте, это нормально. Напишите в поддержку за помощью (https://t.me/CarpAISupportBot) 
Для простоты, я рекомендую этот кошелек https://t.me/wallet (никак не связаны с CarpAI). Зарегистрируйтесь и пополните баланс на нужную сумму. 
Далее, как только ссылка для оплаты была создана, оплатите используя либо адрес кошелька либо QR код в течении 30 минут. 
<b>Не забудьте ввести промокод CRYPTO для скидки в 20%!</b> 
  
<u>ВНИМАНИЕ: ЕСЛИ ВЫ ИСПОЛЬЗУЕТЕ USDT, ВЫ ДОЛЖНЫ ИСПОЛЬЗОВАТЬ TRC20 СЕТЬ, ИНАЧЕ СРЕДСТВА БУДУТ БЕЗВОЗВРАТНО ПОТЕРЯНЫ.</u>]]
LANG["ru"]["$DONATE_CRYPTO_PROCEED"]     = "Далее"
LANG["ru"]["$DONATE_CRYPTO_AWAIT"]       = "Пожалуйста дождитесь генерации ссылки для оплаты"
LANG["ru"]["$DONATE_CRYPTO_PAYMENT"]     = "Получилось! Теперь перейдите по этой ссылке для оплаты:\n%s"
LANG["ru"]["$DONATE_SUBSCRIPTIONS"]      = "Подписка"
LANG["ru"]["$DONATE_SUBSCRIPTIONS_TEXT"] = [[Доступно всего 3 тира подписок:
Тир 1:
    500 токенов на ваш счет каждый месяц
    11100 дополнительных токенов на месяц (расходуются первыми)
    Цена: 500 ₽/месяц

Тир 2:
    1750 токенов на ваш счет каждый месяц
    38850 дополнительных токенов на месяц (расходуются первыми)
    Доступ к закрытым тестам новых функций
    Цена: 1500 ₽/месяц
    
Тир 3:
    3780 токенов на ваш счет каждый месяц
    83160 дополнительных токенов на месяц (расходуются первыми)
    Доступ к закрытым тестам новых функций
    Вы становитесь огромным гигачадом и можете запросить что угодно (в рамках разумного конечно)
    Цена: 3000 ₽/месяц]]
LANG["ru"]["$DONATE_OPTIONS"]            = [[Есть два типа оплаты
Подписка: Лучшее соотношение цена/качество
Обычная покупка: Чуть дороже, но зато не подписка, верно?

Для оплаты, вы можете либо перевести деньги вручную через поддержку либо использовать автоматическую оплату криптовалютой. Оплата в крипте также имеет скидку в 20% на любую покупку!
]]
LANG["ru"]["$DONATE_CASH"]               = "Перевод"
LANG["ru"]["$DONATE_CASH_GUIDE"]         = "Автоматическая оплата по переводу еще не доступна. Вам придется написать в поддержку (https://t.me/CarpAISupportBot) и сказать что именно вы хотите купить"
LANG["ru"]["$DONATE_CASH_PAYMENT"]       = "Пожалуйста напишите в поддержку и мы поможем вам с покупкой\nhttps://t.me/CarpAISupportBot"
LANG["ru"]["$DONATE_CASH_PROCEED"]       = "Продолжить"
LANG["ru"]["$DONATE_REGULAR"]             = "Обычная покупка"
LANG["ru"]["$DONATE_REGULAR_TEXT"]        = [[Доступно всего 6 наборов. Каждый набор выгодней чем предыдущий:
625 Токенов - 100 ₽
1720 Токенов - 250 ₽
3750 Токенов - 500 ₽
8125 Токенов - 1000 ₽
13125 Токенов - 1500 ₽
28125 Токенов - 3000 ₽]]


LANG["ru"]["$DISPLAY_NAME"]             = "Имя в чате"
LANG["ru"]["$DISPLAY_NAME_TEXT"]        = "Введите свое новое имя (имя в истории сообщений не изменится)"
LANG["ru"]["$DISPLAY_NAME_SUCCESS"]     = "Имя изменено!"


LANG["ru"]["$PROMOCODE"]                = "Ввести промокод"
LANG["ru"]["$PROMOCODE_TEXT"]            = "Введите промокод чтобы получить бесплатные токены."
LANG["ru"]["$PROMOCODE_REFERAL_FAILURE"] = "Вы уже вводили реферальный промокод"
LANG["ru"]["$PROMOCODE_REFERAL_SUCCESS"] = "Реферальный промокод успешно введен!"
LANG["ru"]["$PROMOCODE_SUCCESS"]         = "Промокод успешно введен!"
LANG["ru"]["$PROMOCODE_NOTFOUND"]        = "Данный промокод не был найден. Проверьте правильность написания"
LANG["ru"]["$PROMOCODE_ALREADYUSED"]     = "Вы уже использовали этот промокод!"

LANG["ru"]["$DAILIES"]                    = "Ежедневные токены"
LANG["ru"]["$DAILIES_SUCCESS"]            = "Вы получили ежедневный бонус!"
LANG["ru"]["$DAILIES_TIME_FAILURE"]       = "Вы уже получали бонус в последние 24 часа!"
LANG["ru"]["$DAILIES_BALANCE_FAILURE"]    = "Для получения бонуса нужно иметь меньше токенов на балансе!"

LANG["ru"]["$LANG_CHANGE_TEXT"]          = "Выберите язык"


LANG["ru"]["$SELECT_MODEL"]               = "[NEW] Выбрать AI"
LANG["ru"]["$SELECT_MODEL_TEXT"]          = [[Выберите модель, которая будет использоваться для генерации ответов.

Capybara7B: Новая стандартная модель в боте, дешевле чем OpenAI и лучше чем орда, но все еще довольно посредственно
OpenAI: Стоит дороже и генерирует ответы лучшего качества, но производительность в NSFW чатах ужасная.
Dolphin8x7B: Модель на основе Mistral8x7b. Ответы хорошего качества, но дороже чем капибара (стоит того)
Soliloque8B: Модель на основе новенькой Llama3 которая была создана специально для РП. На удивление умная для своего размера модель. Поддерживает NSFW.
[NEW] Llama3: Оригинальная Llama3. Показывает себя хуже чем тот же Soliloque, но все еще неплохо. Стоит так же как и капибара.
]]

LANG["ru"]["$SELECT_MODEL_SUCCESS"]       = "Получилось!"
LANG["ru"]["$MODEL_OPENAI"]               = "OpenAI"
LANG["ru"]["$MODEL_CAPYBARA"]             = "Capybara7B"
LANG["ru"]["$MODEL_HORDE"]                = "Horde"
LANG["ru"]["$MODEL_DOLPHIN"]              = "Dolphin8x7B"
LANG["ru"]["$MODEL_SOLILOQUE"]            = "Soliloque8B"
LANG["ru"]["$MODEL_LLAMA8"]               = "[NEW] Llama3"



LANG["ru"]["$AWAIT_FOR_MESSAGE"]        = "Сообщение генерируется..."
LANG["ru"]["$UNFINISHED_GENERATION"]    = "Дождитесь генерации сообщения..."