LANG["ua"] = {}
LANG["ua"]["$SYMBOL"] = "🇺🇦"
--LANG["ua"]["$COMMAND_SELECT_DESCRIPTION"] = 
LANG["ua"]["$INTRODUCTION"] = [[Це бот, який дозволяє вам вільно спілкуватися з персонажами з аніме, ігор... ну i так далі. 
Ви можете робити з цими персонажами все, що захочете. Я не підтримую жодної цензури. Просто веселіться!
Кожне повідомлення коштує токни, ви отримуєте їх із безкоштовним щоденним бонусом або купуєте їх за передплатою (найвигідніше) чи окремо.
Якщо ви зіткнулися з дивною поведінкою бота або у вас є класна ідея, не соромтеся писати в підтримку (https://t.me/CarpAISupportBot).

Керівництво з написання повідомлень:
Усе просто. Звичайний текст - це мова, усе, що укладено в звездочки, це дії.]]

LANG["ua"]["$NEW_CHAR"] = "Створити новий чат"
LANG["ua"]["$NEW_CHAR_MSG"] = "Ось список усіх доступних символів, натисніть на один, щоб дізнатися більше"
LANG["ua"]["$NEW_CHAR_BACK"] = "Назад"
LANG["ua"]["$NEW_CHAR_SELECT"] = "Виберіть"
LANG["ua"]["$NEW_CHAR_REWRITE"] = "ПОПЕРЕДЖЕННЯ: у вас вже є чат з цим символом. Ви можете вибрати його за допомогою відповідного меню. Якщо ви продовжите, ви видалите існуючий чат. Продовжити?"
LANG["ua"]["$NEW_CHAR_CONFIRM"] = "Підтвердити видалення"


LANG["ua"]["$LOAD_CHAR"] = "Відкрити активний чат"
LANG["ua"]["$LOAD_CHAR_MSG"] = "Ось список усіх активних чатів. Натисніть на один, щоб відкрити чат з цим символом"
LANG["ua"]["$LOAD_CHAR_BACK"] = "Назад"


LANG["ua"]["$CHAT_BACK"] = "Назад"
LANG["ua"]["$CHAT_REGENERATE"] = "Відновити"
LANG["ua"]["$CHAT_NOT_ENOUGH_TOKENS"] = "У вас недостатньо токенів!"
LANG["ua"]["$CHAT_GENERATION_FAULT"] = "Під час генерації повідомлення сталася помилка. Спробуйте ще раз"
LANG["ua"]["$CHAT_GENERATION_IMPOSSIBLE"]= "Через підвищений попит генерацію неможливо завершити. Спробуйте ще раз"


LANG["ua"]["$TOKENS"] = "Гаманець"
LANG["ua"]["$TOKENS_CURRENT_BALANCE"] = "У вас є %s токенів.\nВаш рівень підписки також дає вам екстра %s токенів на цей місяць"
LANG["ua"]["$TOKENS_BACK"] = "Назад"


LANG["ua"]["$DONATE_TEXT"] = [[Купівля токенів або підписки вручну через підтримку (https://t.me/CarpAISupportBot). Будь-який рівень вашої підтримки неймовірно важливий для нас i допомагає розвиватися. Спасибі величезне!]]
LANG["ua"]["$DONATE"] = "Купити токени"


LANG["ua"]["$DISPLAY_NAME"] = "Назва чату"
LANG["ua"]["$DISPLAY_NAME_TEXT"] = "Введіть ваше нове ім'я (ім'я в історії не зміниться)"
LANG["ua"]["$DISPLAY_NAME_SUCCESS"] = "Ім'я успішно змінено!"


LANG["ua"]["$PROMOCODE"] = "Введіть промокод"
LANG["ua"]["$PROMOCODE_TEXT"] = "Введіть промокод, щоб отримати безкоштовні токени"
LANG["ua"]["$PROMOCODE_REFERAL_FAILURE"] = "Ви вже ввели реферальний промокод"
LANG["ua"]["$PROMOCODE_REFERAL_SUCCESS"] = "Реферальний промокод було активовано!"
LANG["ua"]["$PROMOCODE_SUCCESS"] = "Промокод було активовано!"
LANG["ua"]["$PROMOCODE_NOTFOUND"] = "Цей промокод не знайдено. Будь ласка, перевірте написання"
LANG["ua"]["$PROMOCODE_ALREADYUSED"] = "Ви вже використовували цей промокод!"

LANG["ua"]["$DAILIES"] = "Щоденні токени"
LANG["ua"]["$DAILIES_SUCCESS"] = "Ви отримали свій щоденний бонус!"
LANG["ua"]["$DAILIES_TIME_FAILURE"] = "Ви вже отримали щоденний бонус протягом останніх 24 годин!"
LANG["ua"]["$DAILIES_BALANCE_FAILURE"] = "Для отримання бонусу вам потрібно мати менше токенів!"


LANG["ua"]["$LANG_CHANGE_TEXT"] = "Виберіть мову"


LANG["ua"]["$AWAIT_FOR_MESSAGE"] = "Формується повідомлення..."
LANG["ua"]["$UNFINISHED_GENERATION"] = "Будь ласка, зачекайте на завершення генерації..."